import Navbar from "@/components/navbar/Navbar";

Navbar;

const About = () => {
  return (
    <div>
      <Navbar />
      <div className="prose-lg">
        <h1>เราเป็นใคร?</h1>
        <p>
          oknize (โอ-เค-ไน๊) เป็นแพลตฟอร์มของคนทำอีเวนต์
          ที่คิดมาเพื่อคนทำอีเวนต์ จากประสบการณ์ตรงของ Event Producer, Event
          Director ให้ตอบโจทย์คนทำอีเวนต์ให้ได้มากที่สุด
        </p>
        <p>
          เรา เข้าใจถึงปัญหาและความยุ่งยากของการเริ่มทำ Event เป็นอย่างดี
          ไม่ว่าจะเป็น Event ของคุณจะมีขนาดเท่าไหร่
          แต่คงไม่พ้นกับปัญหาจุกจิกที่น่ากวนใจเราทุกคน
        </p>
        <p>
          เรา
          ทำให้คุณมีพื้นที่ที่สามารถออกแบบและจัดการอีเวนต์ของคุณได้แบบครบวงจร
          เริ่มตั้งแต่ ก่อนจัดงาน - วันงาน - ไปจนถึงหลังจบงาน
          เพราะเรารู้ว่าเวลาของคุณมีค่า คุณจะได้พึ่งพาแพลตฟอร์มอื่นๆ น้อยลง{" "}
        </p>
        <p>
          เรา อยากเห็นอีเวนต์ของคุณ ประสบความสำเร็จอย่างที่คุณต้องการ
          เพราะเราเห็นว่าประสบการณ์ผู้เข้าร่วมงานของคุณ เป็นสิ่งที่คุณต้องการ
        </p>
        <p>&quot;เพราะการมีอีเวนต์ คือการบ่งบอกความเป็นมนุษย์&quot;</p>
      </div>
    </div>
  );
};

export default About;
