import Navbar from "@/components/navbar/Navbar";

const About = () => {
  return (
    <div>
      <Navbar />
      <div className="flex flex-col justify-center items-center gap-8 text-xl mx-auto max-w-3xl p-4 lg:p-16">
        <h1 className="text-3xl px-4">
          🙌 โดยผู้จัดอีเวนต์ เพื่อผู้จัดอีเวนต์
        </h1>
        <p>
          👌🏻 oknize (โอ-เค-ไนซ์) เป็นแพลตฟอร์มของคนทำอีเวนต์
          ที่คิดมาเพื่อคนทำอีเวนต์
          จากประสบการณ์ตรงของผู้จัดอีเวนต์ให้ตอบโจทย์คนทำอีเวนต์ให้ได้มากที่สุด
        </p>
        <p>
          เราเข้าใจถึงปัญหาและความยุ่งยากของการเริ่มทำอีเวนต์เป็นอย่างดี
          ไม่ว่าจะเป็นอีเวนต์ของคุณจะมีขนาดเท่าไหร่
          แต่คงไม่พ้นกับปัญหาจุกจิกที่น่ากวนใจเราทุกคน
        </p>
        <p>
          เรา
          ทำให้คุณมีพื้นที่ที่สามารถออกแบบและจัดการอีเวนต์ของคุณได้แบบครบวงจร
          ตั้งแต่ ก่อนจัดงาน - วันงาน - ไปจนถึงหลังจบงาน
          เพราะเรารู้ว่าเวลาของคุณมีค่า คุณจะได้พึ่งพาแพลตฟอร์มอื่นๆ น้อยลง{" "}
        </p>
        <p>
          เรา อยากเห็นอีเวนต์ของคุณ ประสบความสำเร็จอย่างที่คุณต้องการ
          เพราะเราเห็นว่าประสบการณ์ผู้เข้าร่วมงานของคุณ เป็นสิ่งที่คุณต้องการ
        </p>
        <p>&quot;เพราะการมีอีเวนต์ คือการบ่งบอกความเป็นมนุษย์&quot;</p>
      </div>
    </div>
  );
};

export default About;
